Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Are you sure you want to delete the group "%@" and its subgroups? Their connections will be moved to the top level.
fr: Êtes-vous sûr de vouloir supprimer le groupe "%@" et ses sous-groupes ? Les connexions de ces derniers seront déplacées au niveau supérieur.
ko: "%@" 그룹과 하위 그룹을 삭제하시겠습니까? 그 안의 연결은 최상위 수준으로 이동됩니다.
tr: "%@" grubunu ve alt gruplarını silmek istediğinize emin misiniz? İçlerindeki bağlantılar üst seviyeye taşınacaktır.
vi: Bạn có chắc muốn xóa nhóm "%@" và các nhóm con của nó? Các kết nối bên trong sẽ được chuyển lên cấp cao nhất.
zh_hans: 确定要删除分组 "%@" 及其子分组吗？其中的连接将移至顶层。
zh_hant: 確定要刪除群組「%@」及其子群組嗎？其中的連線將移至頂層。

source: Invalid plugin bundle: %@
fr: Paquet de plugins invalide : %@
ko: 잘못된 플러그인 번들: %@
tr: Geçersiz eklenti paketi: %@
vi: Plugin bundle không hợp lệ: %@
zh_hans: 无效的插件包: %@
zh_hant: 外掛套件無效：%@

source: Copies a database file from an SSH server and opens the copy read-only.
fr: Copie un fichier de base de données à partir d'un serveur SSH et ouvre la copie en lecture seule.

source: TablePro could not read the database's own name from the connection.
fr: TablePro n'a pas pu lire le nom propre de la base de données à partir de la connexion.

source: Pause Query History
fr: Pauser l'historique des requêtes
ko: 쿼리 기록 일시 정지
tr: Sorgu Geçmişini Duraklat
vi: Tạm dừng lịch sử truy vấn
zh_hans: 暂停查询历史
zh_hant: 暫停查詢歷史

source: Importing…
fr: Importation en cours...
ko: 가져오는 중…
tr: İçe aktarılıyor…
vi: Đang nhập…
zh_hans: 导入中…
zh_hant: 匯入中…

source: Invalid column indices for reorder operation
fr: Indices de colonne invalides pour l'opération de réordre.
ko: 재정렬 작업의 열 인덱스가 올바르지 않습니다
tr: Yeniden sıralama işlemi için geçersiz sütun dizinleri
vi: Chỉ số cột không hợp lệ cho thao tác sắp xếp lại
zh_hans: 重排序操作的列索引无效
zh_hant: 重新排序操作的欄位索引無效

source: Data only
fr: Seuls les données

source: %1$lld of %2$lld statements ran inside the transaction already open on this connection.
fr: %1$lld des déclarations de %2$lld ont été exécutées à l'intérieur de la transaction déjà ouverte sur cette connexion.

source: The disconnect was cancelled.
fr: La déconnexion a été annulée.

source: Replace %1$@ %2$@
fr: Remplacer %1$@ %2$@
ko: %1$@ %2$@ 교체
tr: %1$@ %2$@ değiştir
vi: Thay thế %1$@ %2$@
zh_hans: 替换 %1$@ %2$@
zh_hant: 取代 %1$@ %2$@

source: None selected
fr: Aucun sélectionné

source: Access uses your ChatGPT subscription (Plus, Pro, Business, or Enterprise) and follows OpenAI's terms. This is an unofficial interface that may change.
fr: Access utilise votre abonnement ChatGPT (Plus, Pro, Business ou Enterprise) et suit les conditions d'OpenAI. Il s'agit d'une interface non officielle qui peut changer.
ko: ChatGPT 구독(Plus, Pro, Business 또는 Enterprise)을 통해 이용하며 OpenAI 약관을 따릅니다. 이는 변경될 수 있는 비공식 인터페이스입니다.
tr: Erişim, ChatGPT aboneliğinizi (Plus, Pro, Business veya Enterprise) kullanır ve OpenAI'nin koşullarına tabidir. Bu, değişebilecek resmi olmayan bir arayüzdür.
vi: Truy cập sử dụng gói đăng ký ChatGPT của bạn (Plus, Pro, Business hoặc Enterprise) và tuân theo điều khoản của OpenAI. Đây là giao diện không chính thức và có thể thay đổi.
zh_hans: 访问会使用你的 ChatGPT 订阅（Plus、Pro、Business 或 Enterprise），并遵循 OpenAI 的条款。这是一个可能会变动的非官方接口。
zh_hant: 存取會使用你的 ChatGPT 訂閱（Plus、Pro、Business 或 Enterprise），並遵循 OpenAI 的條款。這是一個可能會變動的非官方介面。

source: Copy As
fr: Copier comme
ko: 형식으로 복사
tr: Farklı Kopyala
vi: Sao chép dưới dạng
zh_hans: 复制为
zh_hant: 複製為

source: Database the session opened on
fr: Base de données de la session ouverte le
ko: 세션이 열린 데이터베이스
tr: Oturumun açıldığı veritabanı
vi: Cơ sở dữ liệu mà phiên đã mở trên đó
zh_hans: 该会话打开时所在的数据库
zh_hant: 該工作階段開啟時所在的資料庫

source: Restore Previous Values
fr: Restaurer les valeurs précédentes
ko: 이전 값 복원
tr: Önceki Değerleri Geri Yükle
vi: Khôi phục giá trị trước đó
zh_hans: 恢复之前的值
zh_hant: 還原先前的值

source: Connecting to '%@' timed out.
fr: La connexion à '%@' a échoué après une période de temps.
ko: '%@' 연결 시간이 초과되었습니다.
tr: '%@' bağlantısı zaman aşımına uğradı.
vi: Kết nối tới '%@' đã hết thời gian chờ.
zh_hans: 连接'%@'超时。
zh_hant: 連線到 '%@' 已逾時。

source: Apply This Filter
fr: Appliquer ce filtre
ko: 이 필터 적용
tr: Bu Filtreyi Uygula
vi: Áp dụng bộ lọc này
zh_hans: 应用此筛选
zh_hant: 套用此篩選

source: ^[%lld row](inflect: true)
fr: ^[%lld rang](inflect: vrai)
ko: %lld행
tr: %lld satır
vi: %lld dòng
zh_hans: %lld 行
zh_hant: %lld 列

source: Examples
fr: Exemples
ko: 예시
tr: Örnekler
vi: Ví dụ
zh_hans: 示例
zh_hant: 範例

source: Trust and Install
fr: Confiance et installation
ko: 신뢰하고 설치
tr: Güven ve Kur
vi: Tin cậy và cài đặt
zh_hans: 信任并安装
zh_hant: 信任並安裝

source: A newer version of TablePro is required for this plugin. Update TablePro to keep using it.
fr: Une version plus récente de TablePro est requise pour ce plugin. Mettez à jour TablePro pour continuer à l'utiliser.
ko: 이 플러그인을 사용하려면 최신 버전의 TablePro가 필요합니다. 계속 사용하려면 TablePro를 업데이트하십시오.
tr: Bu eklenti için TablePro'nun daha yeni bir sürümü gerekiyor. Kullanmaya devam etmek için TablePro'yu güncelleyin.
vi: Plugin này cần phiên bản TablePro mới hơn. Cập nhật TablePro để tiếp tục sử dụng.
zh_hans: 此插件需要更新版本的TablePro。请更新TablePro以继续使用。
zh_hant: 這個外掛需要更新版本的 TablePro。請更新 TablePro 以繼續使用。

source: Rows the session reads appear here.
fr: Les lignes de la session qui sont lues apparaissent ici.

source: Add
fr: Ajouter
ko: 추가
tr: Ekle
vi: Thêm
zh_hans: 添加
zh_hant: 新增

source: Option as Meta key
fr: Option comme clé Meta
ko: Option 키를 Meta 키로 사용
tr: Option tuşunu Meta olarak kullan
vi: Dùng Option làm phím Meta
zh_hans: 将 Option 用作 Meta 键
zh_hant: 將 Option 作為 Meta 鍵

source: Unsupported intent: %@
fr: Intention non prise en charge : %@
ko: 지원되지 않는 인텐트: %@
tr: Desteklenmeyen niyet: %@
vi: Intent không hỗ trợ: %@
zh_hans: 不支持的 intent：%@
zh_hant: 不支援的 intent：%@

source: Driver plugin not loaded. Open Settings to update.
fr: Le plugin pilote n'est pas chargé. Ouvrez les paramètres pour mettre à jour.
ko: 드라이버 플러그인을 불러오지 못했습니다. 설정을 열어 업데이트하십시오.
tr: Sürücü eklentisi yüklenmedi. Güncellemek için Ayarlar'ı açın.
vi: Plugin driver chưa được tải. Mở Cài đặt để cập nhật.
zh_hans: 驱动插件未加载。请打开设置进行更新。
zh_hant: 驅動程式外掛未載入。請開啟設定進行更新。

source: No saved changes to '%@' are being kept.
fr: Aucune modification enregistrée de '%@' n'est conservée.
ko: '%@'에 대해 보관 중인 저장된 변경 사항이 없습니다.
tr: '%@' için saklanan kaydedilmiş değişiklik yok.
vi: Không có thay đổi đã lưu nào của '%@' đang được giữ lại.
zh_hans: 没有为 '%@' 保留任何已保存的更改。
zh_hant: 沒有為 '%@' 保留任何已儲存的變更。

source: Shows how the time was spent
fr: Montre comment le temps a été passé

source: Sentinel Username
fr: Nom d'utilisateur Sentinel
ko: 센티널 사용자 이름
tr: Sentinel Kullanıcı Adı
vi: Tên người dùng Sentinel
zh_hans: 哨兵用户名
zh_hant: 哨兵使用者名稱

source: Table that was described
fr: Table décrite
ko: 설명된 테이블
tr: Açıklanan tablo
vi: Bảng đã được mô tả
zh_hans: 被描述的表
zh_hant: 被描述的資料表

source: Table the DDL describes
fr: Tableau décrit par la DDL
ko: DDL이 설명하는 테이블
tr: DDL'in açıkladığı tablo
vi: Bảng mà DDL mô tả
zh_hans: 该 DDL 所描述的表
zh_hant: 該 DDL 所描述的資料表

source: Map of %1$d shapes from %2$d rows.
fr: Carte des formes %1$d à partir de %2$d lignes.

source: Foreign key references a column that does not exist: %@
fr: La clé étrangère fait référence à une colonne qui n'existe pas : %@

source: Preserve all values as strings
fr: Conserver tous les valeurs sous forme de chaînes de caractères.
ko: 모든 값을 문자열로 유지
vi: Giữ nguyên tất cả giá trị dưới dạng chuỗi
zh_hans: 将所有值保留为字符串
zh_hant: 將所有值保留為字串

source: The operation failed.
fr: L'opération a échoué.

source: Copy finished
fr: Copie terminée

source: An MCP client wants to access '%@' (%@). Allow?
fr: Un client MCP veut accéder à '%@' (%@). Autoriser ?
ko: MCP 클라이언트가 '%@' (%@)에 접근하려고 합니다. 허용하시겠습니까?
tr: Bir MCP istemcisi '%@' (%@) erişmek istiyor. İzin verilsin mi?
vi: Một MCP client muốn truy cập '%@' (%@). Cho phép?
zh_hans: MCP 客户端请求访问 '%@'（%@）。是否允许？
zh_hant: 有 MCP 用戶端想要存取「%@」（%@）。是否允許？

source: Filter operator: %@
fr: Opérateur de filtrage : %@
ko: 필터 연산자: %@
tr: Filtre operatörü: %@
vi: Toán tử lọc: %@
zh_hans: 筛选运算符: %@
zh_hant: 篩選運算子：%@

source: API key is required
fr: La clé API est requise
ko: API 키가 필요합니다
tr: API anahtarı gerekli
vi: Yêu cầu khóa API
zh_hans: 需要 API 密钥
zh_hant: 需要 API key

source: Export the result of a query, or whole tables, as CSV, JSON, or SQL INSERT statements. With output_path the file is written inside the user's Downloads folder and never overwrites an existing file; without it the text comes back inline. SQL output uses the connection's own quoting and literal rules, so exporting a query needs 'sql_table' to name the target table.
fr: Exporter le résultat d'une requête, ou des tables entières, sous forme de déclarations SQL INSERT, CSV, JSON ou JSON. Avec output_path, le fichier est écrit dans le dossier Téléchargements de l'utilisateur et ne remplace jamais un fichier existant ; sans cela, le texte revient en ligne. L'affichage SQL utilise les règles de citation et de littérales propres à la connexion, donc l'exportation d'une requête nécessite 'sql_table' pour nommer la table cible.
ko: 쿼리 결과 또는 테이블 전체를 CSV, JSON 또는 SQL INSERT 명령문으로 내보냅니다. output_path를 주면 사용자의 다운로드 폴더 안에 파일을 쓰며 기존 파일을 덮어쓰지 않습니다. 주지 않으면 텍스트를 그대로 반환합니다. SQL 출력은 연결 고유의 인용 및 리터럴 규칙을 따르므로, 쿼리를 내보낼 때는 대상 테이블을 지정하는 'sql_table'이 필요합니다.
tr: Bir sorgunun sonucunu veya tabloların tamamını CSV, JSON ya da SQL INSERT ifadeleri olarak dışa aktarır. output_path verildiğinde dosya kullanıcının İndirilenler klasörüne yazılır ve mevcut bir dosyanın üzerine asla yazmaz; verilmediğinde metin doğrudan döner. SQL çıktısı bağlantının kendi tırnak ve değişmez değer kurallarını kullanır, bu yüzden bir sorguyu dışa aktarmak hedef tabloyu adlandıran 'sql_table' gerektirir.
vi: Xuất kết quả của một truy vấn, hoặc toàn bộ bảng, dưới dạng CSV, JSON hoặc câu lệnh SQL INSERT. Có output_path thì tệp được ghi vào thư mục Downloads của người dùng và không bao giờ ghi đè tệp có sẵn; không có thì văn bản trả về trực tiếp. Đầu ra SQL dùng quy tắc trích dẫn và literal riêng của kết nối, nên xuất một truy vấn cần 'sql_table' để đặt tên bảng đích.
zh_hans: 把一个查询的结果，或者整张表，导出为 CSV、JSON 或 SQL INSERT 语句。提供 output_path 时，文件写入用户的下载文件夹，且绝不覆盖已有文件；不提供时，文本直接返回。SQL 输出使用该连接自己的引号和字面量规则，因此导出查询需要用 'sql_table' 指定目标表。
zh_hant: 把一個查詢的結果，或者整張資料表，匯出為 CSV、JSON 或 SQL INSERT 陳述式。提供 output_path 時，檔案寫入使用者的下載檔案夾，且絕不覆蓋已有檔案；不提供時，文字直接回傳。SQL 輸出使用該連線自己的引號和字面值規則，因此匯出查詢需要用 'sql_table' 指定目標資料表。

source: %@, Pro feature
fr: %@, Fonction Pro
ko: %@, Pro 기능
tr: %@, Pro özelliği
vi: %@, tính năng Pro
zh_hans: %@，Pro 功能
zh_hant: %@，Pro 功能

source: expand
fr: développer
ko: 펼치기
tr: genişlet
vi: mở rộng
zh_hans: 展开
zh_hant: 展開

source: Trigger: %@
fr: Déclencheur : %@
ko: 트리거: %@
tr: Tetikleyici: %@
zh_hans: 触发器：%@
zh_hant: 觸發器：%@

source: Could not read the partitions of %@.
fr: Impossible de lire les partitions de %@.
ko: %@의 파티션을 읽지 못했습니다.
tr: %@ için bölümler okunamadı.
vi: Không đọc được các phân vùng của %@.
zh_hans: 无法读取 %@ 的分区。
zh_hant: 無法讀取 %@ 的分割區。

source: %lld objects
fr: %lld objets
ko: %lld개 객체
tr: %lld nesne
vi: %lld đối tượng
zh_hans: %lld 个对象
zh_hant: %lld 個物件

source: The triggers on %1$@ in %2$@ could not be listed: %3$@
fr: Les déclencheurs sur %1$@ dans %2$@ ne pouvaient pas être listés : %3$@

source: Toggle AI Chat (⌘⇧L)
fr: Activer/désactiver le chat IA (⌘⇧L)
ko: AI 채팅 표시/숨기기(⌘⇧L)
vi: Bật/tắt AI Chat (⌘⇧L)
zh_hans: 切换 AI 聊天 (⌘⇧L)
zh_hant: 切換 AI 聊天 (⌘⇧L)

source: Status Dot
fr: Point de statut
ko: 상태 표시점
vi: Chấm trạng thái
zh_hans: 状态指示点
zh_hant: 狀態指示點

source: The output was cut short.
fr: La sortie a été raccourcie.

# Cursor position %d exceeds SQL length (%d)
source: Cursor position %1$d exceeds SQL length (%2$d)
fr: La position du curseur %1$d dépasse la longueur de SQL (%2$d)
ko: 커서 위치 %1$d이(가) SQL 길이(%2$d)를 초과합니다
tr: İmleç konumu %d, SQL uzunluğunu (%d) aşıyor
vi: Vị trí con trỏ %d vượt quá độ dài SQL (%d)
zh_hans: 光标位置%d超出SQL长度（%d）
zh_hant: 游標位置 %1$d 超出 SQL 長度（%2$d）

source: Nobody has joined this team yet.
fr: Personne n'a encore rejoint cette équipe.
ko: 아직 이 팀에 참여한 사람이 없습니다.
tr: Bu takıma henüz kimse katılmadı.
vi: Chưa có ai tham gia nhóm này.
zh_hans: 还没有人加入此团队。
zh_hant: 還沒有人加入此團隊。

source: That doesn't look like a valid license key. Check for typos and try again.
fr: Cela ne ressemble pas à une clé de licence valide. Vérifiez les fautes de frappe et réessayez.
ko: 올바른 라이선스 키가 아닌 것 같습니다. 오타가 있는지 확인하고 다시 시도하십시오.
tr: Bu geçerli bir lisans anahtarı gibi görünmüyor. Yazım hatalarını kontrol edip tekrar deneyin.
vi: Mã giấy phép không hợp lệ. Kiểm tra lỗi chính tả và thử lại.
zh_hans: 这看起来不是有效的许可证密钥。请检查是否有拼写错误后重试。
zh_hant: 這看起來不是有效的授權金鑰。請檢查是否有拼字錯誤後再試一次。

source: target value, differs
fr: Valeur cible, diffère

source: This TRUNCATE query will permanently delete all rows in the table. This action cannot be undone.
fr: Cette requête TRUNCATE supprime définitivement toutes les lignes de la table. Cette action ne peut être annulée.
ko: 이 TRUNCATE 쿼리는 테이블의 모든 행을 영구적으로 삭제합니다. 이 작업은 실행 취소할 수 없습니다.
vi: Truy vấn TRUNCATE này sẽ xóa vĩnh viễn tất cả dòng trong bảng. Thao tác này không thể hoàn tác.
zh_hans: 此 TRUNCATE 查询将永久删除表中的所有行。此操作无法撤销。
zh_hant: 此 TRUNCATE 查詢將永久刪除資料表中的所有列。此動作無法復原。

source: This will reset all settings across every section to their default values.
fr: Cela réinitialisera toutes les paramètres de chaque section à leurs valeurs par défaut.
ko: 모든 섹션의 설정을 기본값으로 재설정합니다.
tr: Bu işlem tüm bölümlerdeki ayarları varsayılan değerlerine sıfırlayacaktır.
vi: Thao tác này sẽ đặt lại tất cả cài đặt ở mọi mục về giá trị mặc định.
zh_hans: 这将把所有部分的设置重置为默认值。
zh_hant: 此操作會將所有區段的設定重設為預設值。

source: SSH Profiles:
fr: Profils SSH :
ko: SSH 프로필:
tr: SSH Profilleri:
vi: Hồ sơ SSH:
zh_hans: SSH 配置：
zh_hant: SSH 設定檔：

source: Run in a transaction
fr: Exécuter dans une transaction
ko: 트랜잭션으로 실행
tr: Bir işlem içinde çalıştır
vi: Chạy trong một giao dịch
zh_hans: 在事务中运行
zh_hant: 在交易中執行

source: Pagination Settings
fr: Paramètres de pagination
ko: 페이지 매김 설정
vi: Cài đặt phân trang
zh_hans: 分页设置
zh_hant: 分頁設定

source: The target database may be in a partial state. Review the database and clean up as needed.
fr: La base de données cible peut être en état partiel. Vérifiez la base de données et nettoyez-la si nécessaire.
ko: 대상 데이터베이스가 불완전한 상태일 수 있습니다. 데이터베이스를 검토하고 필요에 따라 정리하십시오.
tr: Hedef veritabanı kısmi bir durumda olabilir. Veritabanını gözden geçirin ve gerektiği gibi temizleyin.
vi: Cơ sở dữ liệu đích có thể đang ở trạng thái dở dang. Hãy xem lại và dọn dẹp nếu cần.
zh_hans: 目标数据库可能处于不完整状态。请检查数据库并按需清理。
zh_hant: 目標資料庫可能處於不完整的狀態。請檢查資料庫並視需要清理。

source: Safe Mode
fr: Mode sécurisé
ko: 안전 모드
tr: Güvenli Mod
vi: Chế độ an toàn
zh_hans: 安全模式
zh_hant: 安全模式

source: Could not save the profile. Reopen the SSH settings and try again.
fr: Impossible d'enregistrer le profil. Réouvre les paramètres SSH et réessayez.

source: Include byte order mark
fr: Inclure la marque d'ordre des octets
ko: 바이트 순서 표시 포함
tr: Bayt sırası işaretini ekle
vi: Bao gồm dấu thứ tự byte
zh_hans: 包含字节顺序标记
zh_hant: 包含位元組順序記號

source: A SQL condition, such as status = 'active'
fr: Une condition SQL, telle que le statut = 'actif'

source: Reset All Settings to Defaults
fr: Réinitialiser toutes les paramètres aux valeurs par défaut
ko: 모든 설정을 기본값으로 재설정
tr: Tüm Ayarları Varsayılana Sıfırla
vi: Đặt lại tất cả cài đặt về mặc định
zh_hans: 将所有设置重置为默认值
zh_hant: 將所有設定重設為預設值

source: Default Value
fr: Valeur par défaut
ko: 기본값
tr: Varsayılan Değer
vi: Giá trị mặc định
zh_hans: 默认值
zh_hant: 預設值

source: Schema the object belongs to
fr: Schéma à partir duquel l'objet appartient
ko: 객체가 속한 스키마
tr: Nesnenin ait olduğu şema
vi: Schema mà đối tượng thuộc về
zh_hans: 该对象所属的 Schema
zh_hant: 該物件所屬的綱要

source: The filter field is not in the toolbar.
fr: Le champ de filtrage n'est pas dans la barre d'outils.
ko: 필터 필드가 도구 막대에 없습니다.
tr: Filtre alanı araç çubuğunda değil.
vi: Trường bộ lọc không có trên thanh công cụ.
zh_hans: 筛选字段不在工具栏中。
zh_hant: 篩選欄位不在工具列中。

source: No linked folders. Add a folder to watch for shared connection files.
fr: Aucun dossier lié. Ajoutez un dossier pour surveiller les fichiers de connexion partagés.
ko: 연결된 폴더가 없습니다. 공유 연결 파일을 감시할 폴더를 추가하십시오.
tr: Bağlantılı klasör yok. Paylaşılan bağlantı dosyalarını izlemek için bir klasör ekleyin.
vi: Không có thư mục liên kết. Thêm thư mục để theo dõi tệp kết nối chia sẻ.
zh_hans: 没有链接文件夹。添加文件夹以监视共享连接文件。
zh_hant: 沒有已連結的資料夾。新增資料夾以監看共用的連線檔案。

source: %@ are invalid, so queries skip them and exports leave them out. Drop them, or rebuild them with REINDEX.
fr: %@ sont invalides, donc les requêtes les ignorent et les exports ne les incluent pas. Supprimez-les ou reconstruisez-les avec REINDEX.

source: No connections found to import
fr: Aucune connexion trouvée pour l'importation.
ko: 가져올 연결을 찾을 수 없음
tr: İçe aktarılacak bağlantı bulunamadı
vi: Không tìm thấy kết nối nào để nhập
zh_hans: 没有找到可导入的连接
zh_hant: 找不到可匯入的連線

source: Grant the SSH account read access, or connect as a user that already has it.
fr: Accordez l'accès de lecture au compte SSH, ou connectez-vous en tant qu'utilisateur qui en a déjà un.
ko: SSH 계정에 읽기 권한을 부여하거나, 이미 권한이 있는 사용자로 연결하십시오.
tr: SSH hesabına okuma izni verin veya bu izne zaten sahip bir kullanıcıyla bağlanın.
vi: Hãy cấp quyền đọc cho tài khoản SSH, hoặc kết nối bằng một người dùng đã có quyền đó.
zh_hans: 请给该 SSH 账户授予读取权限，或改用已有该权限的用户连接。
zh_hant: 請給該 SSH 帳號授予讀取權限，或改用已有該權限的使用者連線。

source: No items
fr: Aucun article
ko: 항목 없음
tr: Öğe yok
vi: Không có mục nào
zh_hans: 没有项目
zh_hant: 沒有項目

source: Search fields…
fr: Champs de recherche...
ko: 필드 검색…
tr: Alanlarda ara…
vi: Tìm trường…
zh_hans: 搜索字段…
zh_hant: 搜尋欄位…

source: Password Required
fr: Mot de passe requis
ko: 암호 필요
tr: Şifre Gerekli
vi: Yêu cầu mật khẩu
zh_hans: 需要密码
zh_hant: 需要密碼

source: The file goes back to its staged version. You can't undo this action.
fr: Le fichier retourne à sa version en cours de mise en scène. Vous ne pouvez pas annuler cette action.

source: JSON-style document database
fr: Base de données de documents au style JSON
ko: JSON 형식의 문서 데이터베이스
tr: JSON tarzı belge veritabanı
vi: Cơ sở dữ liệu document kiểu JSON
zh_hans: JSON 风格的文档数据库
zh_hant: JSON 風格的文件資料庫

source: Pass at least one table.
fr: Passez au moins une table.
ko: 테이블을 하나 이상 전달하십시오.
tr: En az bir tablo geçirin.
vi: Hãy truyền ít nhất một bảng.
zh_hans: 请至少传入一张表。
zh_hant: 請至少傳入一張資料表。

source: %lld seconds
fr: %lld secondes
ko: %lld초
tr: %lld saniye
vi: %lld giây
zh_hans: %lld 秒
zh_hant: %lld 秒

source: This tool takes your password on its command line.
fr: Cet outil prend votre mot de passe sur sa ligne de commande.

source: What matched
fr: Ce qui correspondait
ko: 일치한 대상
tr: Neyin eşleştiği
vi: Thứ đã khớp
zh_hans: 匹配到的内容
zh_hant: 符合的內容

source: Comparison operator
fr: Opérateur de comparaison
ko: 비교 연산자
tr: Karşılaştırma operatörü
vi: Toán tử so sánh
zh_hans: 比较运算符
zh_hant: 比較運算子

source: Decrypt
fr: Déchiffrer
ko: 복호화
tr: Şifre Çöz
vi: Giải mã
zh_hans: 解密
zh_hant: 解密

source: Size to Fit
fr: Taille pour s'adapter
ko: 내용에 맞게 조절
tr: Sığdır
vi: Tự điều chỉnh
zh_hans: 自动调整
zh_hant: 自動調整大小

source: Window Background
fr: Fond de fenêtre
ko: 윈도우 배경
tr: Pencere Arka Planı
vi: Nền cửa sổ
zh_hans: 窗口背景
zh_hant: 視窗背景

source: Fill column "%@"
fr: Remplir la colonne "%@"
ko: "%@" 열 채우기
tr: "%@" sütununu doldur
vi: Điền cột "%@"
zh_hans: 填充列 "%@"
zh_hant: 填入欄位「%@」

source: The source, the target, the mode and the options come back when you load it.
fr: La source, la cible, le mode et les options reviennent lorsque vous la chargez.

source: The server reported an error.
fr: Le serveur a signalé une erreur.

source: Working
fr: De travail

source: Database %1$lld of %2$lld
fr: Base de données %1$lld de %2$lld

source: NULL Value
fr: Valeur NULLE
ko: NULL 값
tr: NULL Değer
vi: Giá trị NULL
zh_hans: NULL 值
zh_hant: NULL 值

source: The document has not loaded, so there is nothing to save it over.
fr: Le document n'a pas été chargé, donc il n'y a rien à le sauvegarder.

source: Template Name
fr: Nom du modèle
ko: 템플릿 이름
vi: Tên mẫu
zh_hans: 模板名称
zh_hant: 範本名稱

source: Referenced columns (comma-separated)
fr: Colonnes référencées (separées par des virgules)
ko: 참조 열(쉼표로 구분)
vi: Cột tham chiếu (phân tách bằng dấu phẩy)
zh_hans: 引用列（逗号分隔）
zh_hant: 參考欄位（以逗號分隔）

source: Token Name
fr: Nom du jeton
ko: 토큰 이름
tr: Token Adı
vi: Tên token
zh_hans: 令牌名称
zh_hant: 權杖名稱

# Apply %@ sync to %@
source: Apply %1$@ sync to %2$@
fr: Appliquer la synchronisation %1$@ à %2$@
ko: %@ 동기화를 %@에 적용
tr: %1$@ eşitlemesini %2$@ üzerine uygula
vi: Áp dụng đồng bộ %1$@ vào %2$@
zh_hans: 将 %1$@ 同步应用到 %2$@
zh_hant: 將 %1$@ 同步套用到 %2$@

source: Google Sign-In Failed
fr: Connexion Google échouée

source: Dashboard Not Available
fr: Cadre de bord non disponible
ko: 대시보드를 사용할 수 없음
tr: Pano Kullanılamıyor
vi: Bảng điều khiển không khả dụng
zh_hans: 仪表盘不可用
zh_hant: 儀表板無法使用

source: For a metered path on Anthropic's commercial terms, add the Claude provider with an API key instead.
fr: Pour un chemin mesuré selon les conditions commerciales d'Anthropic, ajoutez plutôt le fournisseur Claude avec une clé API.
ko: Anthropic의 상용 약관에 따른 종량제 방식을 이용하려면 대신 API 키를 사용해 Claude 제공자를 추가하십시오.
tr: Anthropic'in ticari koşullarıyla kullanım başına ödemeli bir yol için bunun yerine Claude sağlayıcısını bir API anahtarıyla ekleyin.
vi: Nếu muốn cách tính phí theo mức dùng theo điều khoản thương mại của Anthropic, hãy thêm nhà cung cấp Claude bằng khóa API.
zh_hans: 若想走 Anthropic 商业条款下的按量计费路径，请改为添加带 API 密钥的 Claude 提供方。
zh_hant: 若想走 Anthropic 商業條款下的按量計費路徑，請改為新增帶 API 金鑰的 Claude 供應商。

source: Done
fr: Marché conclu!
ko: 완료
tr: Tamam
vi: Xong
zh_hans: 完成
zh_hant: 完成

source: On error
fr: En cas d'erreur
ko: 오류 발생 시
tr: Hata durumunda
vi: Khi có lỗi
zh_hans: 出错时
zh_hant: 發生錯誤時

source: TablePro connects to the first host over a tunnel. The other hosts are not used.
fr: TablePro se connecte au premier hôte via un tunnel. Les autres hôtes ne sont pas utilisés.

source: Enable Cloud SQL Auth Proxy
fr: Activer le proxy Cloud SQL Auth
ko: Cloud SQL Auth Proxy 활성화
tr: Cloud SQL Auth Proxy'yi Etkinleştir
vi: Bật Cloud SQL Auth Proxy
zh_hans: 启用 Cloud SQL Auth Proxy
zh_hant: 啟用 Cloud SQL Auth Proxy

source: This is a built-in theme.
fr: Il s'agit d'un thème intégré.
ko: 이 테마는 기본 제공 테마입니다.
tr: Bu, yerleşik bir temadır.
vi: Đây là chủ đề mặc định.
zh_hans: 这是内置主题。
zh_hant: 這是內建的佈景主題。

source: No connections yet
fr: Pas encore de connexions
ko: 아직 연결 없음
vi: Chưa có kết nối nào
zh_hans: 暂无连接
zh_hant: 尚無連線

source: Import from Codex CLI
fr: Importation depuis Codex CLI
ko: Codex CLI에서 가져오기
tr: Codex CLI'den İçe Aktar
vi: Nhập từ Codex CLI
zh_hans: 从 Codex CLI 导入
zh_hant: 從 Codex CLI 匯入

source: Limits
fr: Limites
ko: 제한
tr: Limitler
vi: Giới hạn
zh_hans: 限制
zh_hant: 限制

source: Generate Script
fr: Générer un script
ko: 스크립트 생성
tr: Betik Oluştur
vi: Tạo script
zh_hans: 生成脚本
zh_hant: 產生指令稿

source: Discard
fr: Jeter
ko: 폐기
tr: Vazgeç
vi: Hủy bỏ
zh_hans: 丢弃
zh_hant: 捨棄

source: Pairing Failed
fr: Échec de la paire
ko: 페어링 실패
tr: Eşleştirme Başarısız
vi: Ghép nối thất bại
zh_hans: 配对失败
zh_hant: 配對失敗

source: You have unsaved changes to the table structure. Refreshing will discard these changes.
fr: Vous avez des modifications non enregistrées à la structure de la table. La mise à jour supprimera ces modifications.
ko: 테이블 구조에 저장하지 않은 변경 사항이 있습니다. 새로 고치면 변경 사항이 사라집니다.
tr: Tablo yapısında kaydedilmemiş değişiklikleriniz var. Yenileme bu değişiklikleri siler.
vi: Bạn có thay đổi chưa lưu trong cấu trúc bảng. Làm mới sẽ hủy các thay đổi này.
zh_hans: 您有未保存的表结构更改。刷新将丢弃这些更改。
zh_hant: 你對資料表結構有未儲存的變更。重新整理會捨棄這些變更。
